# Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение.
# При вызове функции должен создаваться объект-генератор.
# Функция должна вызываться следующим образом: for el in fibo_gen().
# Функция отвечает за получение факториала числа, а в цикле необходимо выводить только первые 15 чисел.


def factorial(n):
    fact = 1
    for i in range(1, n+1):
        fact *= i
        yield fact


for el in factorial(15):
    print(el)